## Staging: load_balancer
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 5 to add, 1 to change, 4 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                         NAME                                          |
|----------|---------------------------------------------------------------------------------------|
| add      | `aws_route53_record.ai_answers_certificate_validation[&quot;*.ai-answers.cdssandbox.xyz&quot;]` |
|          | `aws_route53_record.ai_answers_wildcard`                                              |
| delete   | `aws_route53_record.ai_answers`                                                       |
| update   | `aws_lb_listener.ai_answers_listener`                                                 |
| recreate | `aws_acm_certificate.ai_answers`                                                      |
|          | `aws_acm_certificate_validation.ai_answers`                                           |
|          | `aws_route53_record.ai_answers_certificate_validation[&quot;ai-answers.cdssandbox.xyz&quot;]`   |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_acm_certificate.ai_answers must be replaced
+/- resource "aws_acm_certificate" "ai_answers" {
      ~ arn                       = "arn:aws:acm:ca-central-1:992382783569:certificate/440dd124-a9df-400a-858a-49782a96d1ae" -> (known after apply)
      ~ domain_validation_options = [
          - {
              - domain_name           = "ai-answers.cdssandbox.xyz"
              - resource_record_name  = "_ab895a9c66d5f72b27cf3ee439b88a3c.ai-answers.cdssandbox.xyz."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_1dbd5854332f001e1530bb32d82decb2.zfyfvmchrl.acm-validations.aws."
            },
          + {
              + domain_name           = "*.ai-answers.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "ai-answers.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      ~ id                        = "arn:aws:acm:ca-central-1:992382783569:certificate/440dd124-a9df-400a-858a-49782a96d1ae" -> (known after apply)
      ~ key_algorithm             = "RSA_2048" -> (known after apply)
      ~ not_after                 = "2026-08-26T23:59:59Z" -> (known after apply)
      ~ not_before                = "2025-07-28T00:00:00Z" -> (known after apply)
      ~ pending_renewal           = false -> (known after apply)
      ~ renewal_eligibility       = "ELIGIBLE" -> (known after apply)
      ~ renewal_summary           = [] -> (known after apply)
      ~ status                    = "ISSUED" -> (known after apply)
      ~ subject_alternative_names = [ # forces replacement
          + "*.ai-answers.cdssandbox.xyz",
            # (1 unchanged element hidden)
        ]
        tags                      = {
            "CostCentre" = "ai-answers-staging"
        }
      ~ type                      = "AMAZON_ISSUED" -> (known after apply)
      ~ validation_emails         = [] -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ options (known after apply)
      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # aws_acm_certificate_validation.ai_answers must be replaced
-/+ resource "aws_acm_certificate_validation" "ai_answers" {
      ~ certificate_arn         = "arn:aws:acm:ca-central-1:992382783569:certificate/440dd124-a9df-400a-858a-49782a96d1ae" -> (known after apply) # forces replacement
      ~ id                      = "2025-07-28 16:34:34.749 +0000 UTC" -> (known after apply)
      ~ validation_record_fqdns = [
          - "_ab895a9c66d5f72b27cf3ee439b88a3c.ai-answers.cdssandbox.xyz",
        ] -> (known after apply) # forces replacement
    }

  # aws_lb_listener.ai_answers_listener will be updated in-place
  ~ resource "aws_lb_listener" "ai_answers_listener" {
      ~ certificate_arn                                                       = "arn:aws:acm:ca-central-1:992382783569:certificate/440dd124-a9df-400a-858a-49782a96d1ae" -> (known after apply)
        id                                                                    = "arn:aws:elasticloadbalancing:ca-central-1:992382783569:listener/app/ai-answers-lb/054264388446064f/9f4e1b4b69a68aad"
        tags                                                                  = {}
        # (25 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_route53_record.ai_answers will be destroyed
  # (because aws_route53_record.ai_answers is not in configuration)
  - resource "aws_route53_record" "ai_answers" {
      - fqdn                             = "ai-answers.cdssandbox.xyz" -> null
      - id                               = "Z0155535SR6XQTKZDGDA_ai-answers.cdssandbox.xyz_A" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "ai-answers.cdssandbox.xyz" -> null
      - records                          = [] -> null
      - ttl                              = 0 -> null
      - type                             = "A" -> null
      - zone_id                          = "Z0155535SR6XQTKZDGDA" -> null
        # (2 unchanged attributes hidden)

      - alias {
          - evaluate_target_health = false -> null
          - name                   = "ai-answers-lb-1206359941.ca-central-1.elb.amazonaws.com" -> null
          - zone_id                = "ZQSVJUPU6J1EY" -> null
        }
    }

  # aws_route53_record.ai_answers_certificate_validation["*.ai-answers.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "ai_answers_certificate_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z0155535SR6XQTKZDGDA"
    }

  # aws_route53_record.ai_answers_certificate_validation["ai-answers.cdssandbox.xyz"] must be replaced
-/+ resource "aws_route53_record" "ai_answers_certificate_validation" {
      ~ fqdn                             = "_ab895a9c66d5f72b27cf3ee439b88a3c.ai-answers.cdssandbox.xyz" -> (known after apply)
      ~ id                               = "Z0155535SR6XQTKZDGDA__ab895a9c66d5f72b27cf3ee439b88a3c.ai-answers.cdssandbox.xyz._CNAME" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
      ~ name                             = "_ab895a9c66d5f72b27cf3ee439b88a3c.ai-answers.cdssandbox.xyz" -> (known after apply) # forces replacement
      ~ records                          = [
          - "_1dbd5854332f001e1530bb32d82decb2.zfyfvmchrl.acm-validations.aws.",
        ] -> (known after apply)
      ~ type                             = "CNAME" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_route53_record.ai_answers_wildcard will be created
  + resource "aws_route53_record" "ai_answers_wildcard" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.ai-answers.cdssandbox.xyz"
      + type            = "A"
      + zone_id         = "Z0155535SR6XQTKZDGDA"

      + alias {
          + evaluate_target_health = false
          + name                   = "ai-answers-lb-1206359941.ca-central-1.elb.amazonaws.com"
          + zone_id                = "ZQSVJUPU6J1EY"
        }
    }

Plan: 5 to add, 1 to change, 4 to destroy.

Changes to Outputs:
  ~ lb_listener                 = {
      ~ certificate_arn                                                       = "arn:aws:acm:ca-central-1:992382783569:certificate/440dd124-a9df-400a-858a-49782a96d1ae" -> (known after apply)
        id                                                                    = "arn:aws:elasticloadbalancing:ca-central-1:992382783569:listener/app/ai-answers-lb/054264388446064f/9f4e1b4b69a68aad"
        tags                                                                  = {}
        # (30 unchanged attributes hidden)
    }
  + lb_listener_arn             = "arn:aws:elasticloadbalancing:ca-central-1:992382783569:listener/app/ai-answers-lb/054264388446064f/9f4e1b4b69a68aad"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.ai_answers"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb.ai_answers"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_listener.ai_answers_listener"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_target_group.ai_answers"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.ai_answers_load_balancer_sg"]

24 tests, 19 passed, 5 warnings, 0 failures, 0 exceptions

```

</details>
